print('введите выбор - 1 или 2')
number1 = int(input('введите число N --> '))
startstop = 10
if startstop < number1:
    print('выбор 1 ')

#     bin() это встроенная функция питона, переводящая форму вывода (литерал) числа из десятичного вида в двоичный в виде строки.
# PythonВыделить код
# 1
# 2
# bin(i) -> str
# i - Целое число.
# Примеры
# PythonВыделить код
# 1
# 2
# 3
# 4
# >>> bin(25)
# '0b11001'
# >>> bin(-25)
# '-0b11001'
# Кстати второй вариант, который приняла тестирующая программа, работает не правильно для отрицательных чисел.
# PythonВыделить код
# 1
# 2
# -25
# b11001



