# напишите программу которая принимает на вход вещественное число и показывает сумму его чисел
# пример - 
# 1234 = 10
# 111 = 3

print(sum(map(int,list(input('введите число -> ')))))