# Напишите программу ,которая будет преобразовывать десятичное число в двоичное.

print(bin(45))
