# напишите программу которая обозначает день недели и проверяет ,является этот день выходным. 

testday = lambda a: True if( a <  7) else False
print(testday(4))